---
kind: method
id: M:Autodesk.Revit.DB.RepeaterCoordinates.#ctor(System.Int32)
source: html/2a5f941d-7e4e-b1af-1991-e8fa843244a2.htm
---
# Autodesk.Revit.DB.RepeaterCoordinates.#ctor Method

Creates one dimensional coordinates.

## Syntax (C#)
```csharp
public RepeaterCoordinates(
	int x
)
```

## Parameters
- **x** (`System.Int32`) - The coordinate.